# TODO: Создание репозитория для курсового проекта course_project
Задача 1
Выслать мне в личку (telegram) URL созданного репозитория (python_spring_work_2022).

Задача 2
Добавить в репозиторий python_spring_work_2022 файл git.md
В файле git.md должен быть ваш собственный справочник по Git.

Пример:
## Первоначальная настройка GIT
***выполняется после того, как git был установлен на компьютер или при необходимости внести изменения***

Установить/изменить имя пользователя

    git config --global user.name "Ваше Имя"

Установить/изменить email пользователя

    git config --global user.email ваша@почта.com


Задача 3
1. Создать репозиторий на GitHub с названием course_project
2. Создать папку на локальной машине c названием course_project
3. Превратить созданный каталог в репозиторий Git
4. Создать в папке каталога файл README.MD
5. В файл README.MD внести описание будущего проекта. Желательно с помощью специального синтаксиса Markdown.
6. Создать в папке каталога файл .gitignore
7. В файл .gitignore внести файлы и папки которые не будут подподать под версионный контроль
8. Добавить созданные файлы в локальный репозиторий
9. Связать удаленный репозиторий course_project с локальным
10. Отправить изменения в удаленный репозиторий


Литература:
1. Git Book https://git-scm.com/book/ru/v2
2. Интерактивный тур по git https://githowto.com/ru