##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

# x = 10
# print(x)

number_one = input()
number_two = input()

print(int(number_one) + int(number_two))
print(int(number_one) - int(number_two))
print(int(number_one) / int(number_two))
print(int(number_one) * int(number_two))
print(float(number_one) // float(number_two))
print(int(number_one) % int(number_two))
print(float(number_one) ** float(number_two))